app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards" ORDER BY "cards"."box" ASC, "cards"."name" ASC
---
  def index
    @cards = Card.order(:box, :name)