app/controllers/dashboard_controller.rb

SELECT COUNT(*) FROM "cards"
SELECT COUNT(*) FROM "cards" WHERE (last_reviewed_at IS NULL OR (box = 1 AND last_reviewed_at <= '2026-04-26 19:30:40.386028') OR (box = 2 AND last_reviewed_at <= '2026-04-25 19:30:40.386175') OR (box = 3 AND last_reviewed_at <= '2026-04-23 19:30:40.386194') OR (box = 4 AND last_reviewed_at <= '2026-04-19 19:30:40.386210') OR (box = 5 AND last_reviewed_at <= '2026-04-12 19:30:40.386223'))
SELECT COUNT(*) FROM "cards" WHERE "cards"."box" = 1
---
  def index
    @total = Card.count
    @due   = Card.due.count
    @by_box = (1..Card.const_get(:MAX_BOX)).map { |b| [b, Card.where(box: b).count] }.to_h