app/controllers/study_controller.rb

SELECT "cards".* FROM "cards" WHERE (last_reviewed_at IS NULL OR (box = 1 AND last_reviewed_at <= '2026-04-26 19:30:46.825198') OR (box = 2 AND last_reviewed_at <= '2026-04-25 19:30:46.825323') OR (box = 3 AND last_reviewed_at <= '2026-04-23 19:30:46.825345') OR (box = 4 AND last_reviewed_at <= '2026-04-19 19:30:46.825360') OR (box = 5 AND last_reviewed_at <= '2026-04-12 19:30:46.825374')) ORDER BY RANDOM() LIMIT 1
SELECT COUNT(*) FROM "cards" WHERE (last_reviewed_at IS NULL OR (box = 1 AND last_reviewed_at <= '2026-04-26 19:30:46.831319') OR (box = 2 AND last_reviewed_at <= '2026-04-25 19:30:46.831435') OR (box = 3 AND last_reviewed_at <= '2026-04-23 19:30:46.831451') OR (box = 4 AND last_reviewed_at <= '2026-04-19 19:30:46.831464') OR (box = 5 AND last_reviewed_at <= '2026-04-12 19:30:46.831477'))
SELECT COUNT(*) FROM "cards"
---
  def show
    @card = Card.due.order(Arel.sql("RANDOM()")).first
    @remaining = Card.due.count
    @total     = Card.count